iotest-pmem/fio-output2/libaio-irq-randread-4K-1-1-log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.19
Starting 1 process
test: Laying out IO file (1 file / 10240MiB)

test: (groupid=0, jobs=1): err= 0: pid=470872: Thu Oct 24 14:56:50 2024
  read: IOPS=349k, BW=1363MiB/s (1429MB/s)(79.9GiB/60001msec)
    slat (nsec): min=1530, max=317260, avg=1858.85, stdev=199.78
    clat (nsec): min=540, max=100290, avg=737.66, stdev=91.61
     lat (nsec): min=2160, max=318410, avg=2639.45, stdev=223.87
    clat percentiles (nsec):
     |  1.00th=[  724],  5.00th=[  724], 10.00th=[  732], 20.00th=[  732],
     | 30.00th=[  732], 40.00th=[  732], 50.00th=[  732], 60.00th=[  740],
     | 70.00th=[  740], 80.00th=[  740], 90.00th=[  740], 95.00th=[  748],
     | 99.00th=[  764], 99.50th=[  844], 99.90th=[ 1208], 99.95th=[ 3280],
     | 99.99th=[ 4192]
   bw (  MiB/s): min= 1356, max= 1373, per=100.00%, avg=1364.76, stdev= 4.21, samples=119
   iops        : min=347330, max=351578, avg=349378.27, stdev=1078.99, samples=119
  lat (nsec)   : 750=91.39%, 1000=8.44%
  lat (usec)   : 2=0.09%, 4=0.06%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=17.11%, sys=82.64%, ctx=98, majf=0, minf=26
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=20932499,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1363MiB/s (1429MB/s), 1363MiB/s-1363MiB/s (1429MB/s-1429MB/s), io=79.9GiB (85.7GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%