iotest-pmem/fio-output2/libaio-irq-randread-4K-1-16-log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 16 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping

test: (groupid=0, jobs=16): err= 0: pid=471399: Thu Oct 24 15:02:08 2024
  read: IOPS=6137k, BW=23.4GiB/s (25.1GB/s)(1405GiB/60002msec)
    slat (nsec): min=1211, max=122790, avg=1617.74, stdev=183.98
    clat (nsec): min=500, max=117071, avg=735.16, stdev=87.48
     lat (nsec): min=1880, max=127630, avg=2393.43, stdev=209.04
    clat percentiles (nsec):
     |  1.00th=[  724],  5.00th=[  724], 10.00th=[  724], 20.00th=[  732],
     | 30.00th=[  732], 40.00th=[  732], 50.00th=[  732], 60.00th=[  732],
     | 70.00th=[  740], 80.00th=[  740], 90.00th=[  740], 95.00th=[  748],
     | 99.00th=[  764], 99.50th=[  820], 99.90th=[ 1224], 99.95th=[ 3056],
     | 99.99th=[ 4016]
   bw (  MiB/s): min=23890, max=24175, per=100.00%, avg=24012.49, stdev= 3.68, samples=1904
   iops        : min=6116060, max=6188848, avg=6147196.29, stdev=940.85, samples=1904
  lat (nsec)   : 750=95.33%, 1000=4.49%
  lat (usec)   : 2=0.10%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=17.80%, sys=81.97%, ctx=539, majf=0, minf=437
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=368223144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=23.4GiB/s (25.1GB/s), 23.4GiB/s-23.4GiB/s (25.1GB/s-25.1GB/s), io=1405GiB (1508GB), run=60002-60002msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%