iotest-pmem/fio-output2/libaio-irq-randread-4K-1-4-log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 4 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping
test: Laying out IO file (1 file / 10240MiB)
fio: ENOSPC on laying out file, stopping

test: (groupid=0, jobs=4): err= 0: pid=471150: Thu Oct 24 14:59:29 2024
  read: IOPS=1484k, BW=5798MiB/s (6079MB/s)(340GiB/60001msec)
    slat (nsec): min=1280, max=115111, avg=1697.57, stdev=226.68
    clat (nsec): min=510, max=113071, avg=736.84, stdev=87.31
     lat (nsec): min=1920, max=125210, avg=2476.38, stdev=249.55
    clat percentiles (nsec):
     |  1.00th=[  724],  5.00th=[  724], 10.00th=[  732], 20.00th=[  732],
     | 30.00th=[  732], 40.00th=[  732], 50.00th=[  732], 60.00th=[  740],
     | 70.00th=[  740], 80.00th=[  740], 90.00th=[  740], 95.00th=[  748],
     | 99.00th=[  764], 99.50th=[  844], 99.90th=[ 1224], 99.95th=[ 2992],
     | 99.99th=[ 3984]
   bw (  MiB/s): min= 5777, max= 5847, per=100.00%, avg=5806.79, stdev= 4.06, samples=476
   iops        : min=1479044, max=1496844, avg=1486536.98, stdev=1040.62, samples=476
  lat (nsec)   : 750=93.56%, 1000=6.26%
  lat (usec)   : 2=0.10%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=17.54%, sys=82.24%, ctx=242, majf=0, minf=104
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=89056205,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5798MiB/s (6079MB/s), 5798MiB/s-5798MiB/s (6079MB/s-6079MB/s), io=340GiB (365GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%