iotest-pmem/fio-output2/libaio-irq-randwrite-4K-1-16-log
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.19
Starting 16 processes
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
test: Laying out IO file (1 file / 10240MiB)
[...]

test: (groupid=0, jobs=16): err=28 (file:io_u.c:1803, func=io_u error, error=No space left on device): pid=472134: Thu Oct 24 15:08:45 2024
  write: IOPS=283k, BW=1106MiB/s (1160MB/s)(64.8GiB/60001msec); 0 zone resets
    slat (nsec): min=1950, max=305840, avg=2496.78, stdev=1297.07
    clat (nsec): min=530, max=124720, avg=743.15, stdev=79.88
     lat (usec): min=2, max=306, avg= 3.29, stdev= 1.29
    clat percentiles (nsec):
     |  1.00th=[  700],  5.00th=[  708], 10.00th=[  732], 20.00th=[  740],
     | 30.00th=[  740], 40.00th=[  740], 50.00th=[  740], 60.00th=[  740],
     | 70.00th=[  748], 80.00th=[  748], 90.00th=[  748], 95.00th=[  748],
     | 99.00th=[  772], 99.50th=[  860], 99.90th=[ 1224], 99.95th=[ 2736],
     | 99.99th=[ 3696]
   bw (  MiB/s): min=  465, max= 1233, per=100.00%, avg=1108.31, stdev=229.03, samples=119
   iops        : min=119174, max=315742, avg=283727.01, stdev=58631.90, samples=119
  lat (nsec)   : 750=71.74%, 1000=28.06%
  lat (usec)   : 2=0.12%, 4=0.07%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 250=0.01%
  cpu          : usr=15.28%, sys=84.51%, ctx=173, majf=0, minf=377
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16990145,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1106MiB/s (1160MB/s), 1106MiB/s-1106MiB/s (1160MB/s-1160MB/s), io=64.8GiB (69.6GB), run=60001-60001msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%